const AisFullInfo = () => {
  return (
      <>
          <p className='user-info-popup__paragraph'>
            В структуре отрасли «Образование» <b>480 учреждений</b> (223 казенных, 192 бюджетных, 65 автономных), из них <b>476 образовательных</b> (211 общеобразовательных, 223 дошкольных, 41 учреждение дополнительного образование, оздоровительно-образовательный центр А. И. Бороздина) и <b>4 муниципальные организации,</b> относящиеся к отрасли «Образование» (2 Комбината питания, «ОТН и РМТБОУ», «ГФЭЦ»).
          </p>
          <h4>Организации 2021-2022</h4>
          <ul>
            <li><b>1. Дошкольные образовательные организации - 223</b></li>
            <li><b>2. Общеобразовательные организации – 211 из них:</b>
              <ul>
                <li>Прогимназии <b>2</b></li>
                <li>Средние общеобразовательные школы <b>127</b></li>
                <li>Средние школы с углублённым изучением отдельных предметов <b>14</b></li>
                <li>Гимназии <b>16</b></li>
                <li>Лицеи <b>21</b></li>
                <li>Центры образования <b>5</b></li>
                <li>Основные общеобразовательные школы <b>3</b></li>
                <li>Вечерние (сменные) школы <b>8</b></li>
                <li>Специальные (коррекционные) учреждения <b>14</b></li>
                <li>Школы-интернаты <b>1</b></li>
              </ul>
            </li>
            <li><b>3. Учреждения дополнительного образования – 41 из них:</b>
              <ul>
                <li>для детей <b>38</b></li>
                <li>для взрослых <b>3</b></li>
              </ul>
            </li>
            <li><b>4. МКУДО ДООСПЦ А. И. Бороздина 1</b></li>
            <li><h3>Итого образовательных организаций - 476</h3></li>
            <li><b>5. Прочие муниципальные организации, относящиеся к отрасли «Образование»</b> (2 Комбината питания, «ОТН и РМТБОУ», «ГФЭЦ») – <b>4</b>.
</li>
          </ul>
      </>
  );
};

export default AisFullInfo;
