const MaisCommonInfo = () => {
    return (
        <>
            <p className='user-info-popup__paragraph'>
                Муниципальная система оценки качества образования (далее –
                АИС ОКО города Новосибирска) призвана обеспечить получение, распространение и
                использование достоверной, объективной информации о состоянии и
                тенденциях развития образовательных организаций, управлении
                качеством образования в городе Новосибирске, причинах, влияющих
                на уровень образования, соответствии образовательного процесса
                нормативным требованиям, социальным и личным ожиданиям,
                определении технологий дальнейшего совершенствования МСОКО в
                соответствии с региональными целями управления качеством
                образования.
            </p>
            <p className='user-info-popup__paragraph'>
                АИС ОКО города Новосибирска в открытом доступе для лиц и
                организаций, заинтересованных в социальном партнёрстве по
                вопросам развития системы образования г. Новосибирска
                предоставляет возможность получения объективной информации о
                количественных и качественных показателях муниципальной системы
                образования города Новосибирска.
            </p>
            <p className='user-info-popup__paragraph'>
                В рамках АИС ОКО города Новосибирска используется муниципальная автоматизированная
                информационная система «Муниципальная система оценки качества
                образования города Новосибирска» (далее - АИС ОКО города Новосибирска).
            </p>
            <p className='user-info-popup__paragraph'>
                Для работы в АИС ОКО города Новосибирска необходимо пройти
                процедуру авторизации.
            </p>
            <p className='user-info-popup__paragraph'>
                Авторизированными пользователями являются муниципальные
                образовательные организации, подведомственные департаменту
                образования мэрии города Новосибирска.
            </p>
            <p className='user-info-popup__paragraph'>
                АИС ОКО города Новосибирска предоставляет возможность получения
                следующей информации:
            </p>
            <h4 className='user-info-popup__header'>
                 Для муниципальных органов управления образования
            </h4>
            <ul className='user-info-popup__list'>
                <li>
                    - получение аналитических и статистических данных о качестве
                    образования по общеобразовательным организациям,
                    районам/округу (по районам) по определенным признакам,
                    критериям, показателям, индикаторам;
                </li>
                <li>
                    - прогнозирование повышения качества образования и
                    планирование управленческих действий по реализации прогноза
                    на муниципальном уровне;
                </li>
                <li>
                    - формирование заказа системе повышения квалификации
                    руководителей, школьных административных команд, отдельных
                    категорий педагогических работников.
                </li>
            </ul>
            <h4 className='user-info-popup__header'>
                 Для специалистов организаций повышения квалификации
                педагогических работников
            </h4>
            <ul className='user-info-popup__list'>
                <li>
                    - формирование и реализация программ мероприятий (повышения
                    квалификации руководителей, школьных административных
                    команд, отдельных категорий педагогических работников,
                    методического сопровождения), направленных на повышение
                    качества образования.
                </li>
            </ul>
            <h4 className='user-info-popup__header'>
                 Для образовательных организаций г. Новосибирска
                (административных команд, педагогических коллективов)
            </h4>
            <ul className='user-info-popup__list'>
                <li>- формирование заказа к системе повышения квалификации;</li>
                <li>
                    - отслеживание динамики проблемных компонентов для
                    своевременного реагирования на отклонения от заданных
                    параметров;
                </li>
                <li>
                    - прогнозирование повышения качества образования и
                    планирование управленческих действий по реализации прогноза
                    на учрежденческом уровне, в том числе по совершенствованию
                    ВСОКО
                </li>
            </ul>
        </>
    );
};

export default MaisCommonInfo;
